NSCameraUsageDescription = "需要存取相機才能掃描文件並製作照片和影片。";
NSFaceIDUsageDescription = "使用人臉識別進行身份驗證需要 Face ID。";
NSLocationAlwaysUsageDescription = "此應用程式會使用您的位置，以便在您移動至不同區域時自動觸發檔案上傳。";
NSPhotoLibraryUsageDescription = "需要照片庫存取權限才能將照片和視頻上傳到您的雲端。";
NSPhotoLibraryAddUsageDescription = "需要照片庫存取權限才能將照片和視頻上傳到您的雲端。";
NSMicrophoneUsageDescription = "創建語音筆記需要麥克風存取權限。";
NSLocationWhenInUseUsageDescription = "此應用程式會使用您的位置來偵測移動並自動上傳檔案。此功能不會使用 GPS，也不會儲存您的位置。";
NSLocationAlwaysAndWhenInUseUsageDescription = "此應用程式即使在背景中也需要存取您的位置，以便在偵測到明顯移動時自動開始上傳檔案。此功能不會使用 GPS。";
